-- 科目データ追加用
insert into subjects (subject) values 
('英語試験'), 
('中国語試験'), 
('韓国語試験');

-- 等級データ追加用
insert into grades (grade) values 
('初級'), 
('中級'), 
('上級');

-- 会場データ追加用
insert into places (place) values 
('東京'), 
('名古屋'), 
('大阪'); 

-- 受験料データ追加用
insert into fees (subject_id, grade_id, fee) values 
(1, 1, 5000), 
(1, 2, 6000), 
(1, 3, 7000), 
(2, 1, 5000), 
(2, 2, 6000), 
(2, 3, 7000), 
(3, 1, 5000), 
(3, 2, 6000), 
(3, 3, 7000);

-- 管理者アカウント設定用
-- IDの指定を行ってください
update accounts set 
role = 1 
where id = 

-- サンプルデータ追加用
insert into exam_infos (subject_id, grade_id, exam_date, old_date, place_id, comments, cancel) values 
(1, 1, '2027-05-01', null, 1, null, 0 ), 
(1, 1, '2027-05-02', null, 1, null, 0 ), 
(1, 1, '2027-05-03', null, 1, null, 0 ), 
(1, 1, '2027-05-04', '2027-04-04', 1, '試験日が延期となりました。', 0 ), 
(1, 1, '2027-05-05', null, 1, '試験が中止となりました。', 1 ), 
(1, 1, '2027-05-01', null, 2, null, 0 ), 
(1, 1, '2027-05-02', null, 2, null, 0 ), 
(1, 1, '2027-05-03', null, 2, null, 0 ), 
(1, 1, '2027-05-04', '2027-04-04', 2, '試験日が延期となりました。', 0 ), 
(1, 1, '2027-05-05', null, 2, '試験が中止となりました。', 1 ), 
(1, 1, '2027-05-01', null, 3, null, 0 ), 
(1, 1, '2027-05-02', null, 3, null, 0 ), 
(1, 1, '2027-05-03', null, 3, null, 0 ), 
(1, 1, '2027-05-04', '2027-04-04', 3, '試験日が延期となりました。', 0 ), 
(1, 1, '2027-05-05', null, 3, '試験が中止となりました。', 1 ), 
(1, 2, '2027-05-01', null, 1, null, 0 ), 
(1, 2, '2027-05-02', null, 1, null, 0 ), 
(1, 2, '2027-05-03', null, 1, null, 0 ), 
(1, 2, '2027-05-04', '2027-04-04', 1, '試験日が延期となりました。', 0 ), 
(1, 2, '2027-05-05', null, 1, '試験が中止となりました。', 1 ), 
(1, 2, '2027-05-01', null, 2, null, 0 ), 
(1, 2, '2027-05-02', null, 2, null, 0 ), 
(1, 2, '2027-05-03', null, 2, null, 0 ), 
(1, 2, '2027-05-04', '2027-04-04', 2, '試験日が延期となりました。', 0 ), 
(1, 2, '2027-05-05', null, 2, '試験が中止となりました。', 1 ), 
(1, 2, '2027-05-01', null, 3, null, 0 ), 
(1, 2, '2027-05-02', null, 3, null, 0 ), 
(1, 2, '2027-05-03', null, 3, null, 0 ), 
(1, 2, '2027-05-04', '2027-04-04', 3, '試験日が延期となりました。', 0 ), 
(1, 2, '2027-05-05', null, 3, '試験が中止となりました。', 1 ), 
(1, 3, '2027-05-01', null, 1, null, 0 ), 
(1, 3, '2027-05-02', null, 1, null, 0 ), 
(1, 3, '2027-05-03', null, 1, null, 0 ), 
(1, 3, '2027-05-04', '2027-04-04', 1, '試験日が延期となりました。', 0 ), 
(1, 3, '2027-05-05', null, 1, '試験が中止となりました。', 1 ), 
(1, 3, '2027-05-01', null, 2, null, 0 ), 
(1, 3, '2027-05-02', null, 2, null, 0 ), 
(1, 3, '2027-05-03', null, 2, null, 0 ), 
(1, 3, '2027-05-04', '2027-04-04', 2, '試験日が延期となりました。', 0 ), 
(1, 3, '2027-05-05', null, 2, '試験が中止となりました。', 1 ), 
(1, 3, '2027-05-01', null, 3, null, 0 ), 
(1, 3, '2027-05-02', null, 3, null, 0 ), 
(1, 3, '2027-05-03', null, 3, null, 0 ), 
(1, 3, '2027-05-04', '2027-04-04', 3, '試験日が延期となりました。', 0 ), 
(1, 3, '2027-05-05', null, 3, '試験が中止となりました。', 1 ), 
